CREATE DATABASE  IF NOT EXISTS `rosadb` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `rosadb`;
-- MySQL dump 10.13  Distrib 8.0.42, for Win64 (x86_64)
--
-- Host: localhost    Database: rosadb
-- ------------------------------------------------------
-- Server version	8.0.42

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `clients`
--

DROP TABLE IF EXISTS `clients`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `clients` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `date_of_birth` varchar(45) NOT NULL,
  `address` varchar(200) NOT NULL,
  `e_mail` varchar(100) NOT NULL,
  `telephone` varchar(45) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=45462637 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `clients`
--

LOCK TABLES `clients` WRITE;
/*!40000 ALTER TABLE `clients` DISABLE KEYS */;
INSERT INTO `clients` VALUES (45462526,'Фролов Андрей Иванович','14.07.2001','344288, г. Екатеринбург, ул. Чехова, 1, кв. 34','gohufreilagrau-3818@yopmail.com','8 902 7458765'),(45462527,'Николаев Даниил Всеволодович','10.02.2001','614164, г. Екатеринбург, ул. Степная, 30, кв. 75','xawugosune-1385@yopmail.com','8 902 7458766'),(45462528,'Снегирев Макар Иванович','21.05.1998','394242, г. Екатеринбург, ул. Коммунистическая, 43, кв. 57','satrahuddusei-4458@yopmail.com','8 902 7458767'),(45462529,'Иванов Иван Ильич','01.10.1998','660540, г. Екатеринбург, ул. Солнечная, 25, кв. 78','boippaxeufrepra-7093@yopmail.com','8 902 7458768'),(45462530,'Филиппова Анна Глебовна','31.05.1976','125837, г. Екатеринбург, ул. Шоссейная, 40, кв. 92','zapramaxesu-7741@yopmail.com','8 902 7458769'),(45462531,'Иванов Михаил Владимирович','04.11.1985','125703, г. Екатеринбург, ул. Партизанская, 49, кв. 84','rouzecroummegre-3899@yopmail.com','8 902 7458770'),(45462532,'Власов Дмитрий Александрович','17.08.1998','625283, г. Екатеринбург, ул. Победы, 46, кв. 7','ziyeuddocrabri-4748@yopmail.com','8 902 7458771'),(45462533,'Серова Екатерина Львовна','24.10.1984','614611, г. Екатеринбург, ул. Молодежная, 50, кв. 78','ketameissoinnei-1951@yopmail.com','8 902 7458772'),(45462534,'Борисова Ирина Ивановна','14.10.1976','454311, г. Екатеринбург, ул. Новая, 19, кв. 78','yipraubaponou-5849@yopmail.com','8 902 7458773'),(45462535,'Зайцев Никита Артёмович','14.10.1999','660007, г. Екатеринбург, ул. Октябрьская, 19, кв. 42','crapedocouca-3572@yopmail.com','8 902 7458774'),(45462536,'Медведев Святослав Евгеньевич','13.07.1985','603036, г. Екатеринбург, ул. Садовая, 4, кв. 13','ceigoixakaunni-9227@yopmail.com','8 902 7458775'),(45462537,'Коротков Кирилл Алексеевич','26.05.1976','450983, г. Екатеринбург, ул. Комсомольская, 26, кв. 60','yeimmeiwauzomo-7054@yopmail.com','8 902 7458776'),(45462538,'Калашникова Арина Максимовна','13.08.1999','394782, г. Екатеринбург, ул. Чехова, 3, кв. 14','poleifenevi-1560@yopmail.com','8 902 7458777'),(45462539,'Минина Таисия Кирилловна','13.10.1985','603002, г. Екатеринбург, ул. Дзержинского, 28, кв. 56','kauprezofautei-6607@yopmail.com','8 902 7458778'),(45462540,'Наумов Серафим Романович','15.04.1999','450558, г. Екатеринбург, ул. Набережная, 30, кв. 71','quaffaullelourei-1667@yopmail.com','8 902 7458779'),(45462541,'Воробьева Василиса Евгеньевна','13.01.1999','394060, г. Екатеринбург, ул. Фрунзе, 43, кв. 79','jsteele@rojas-robinson.net','8 902 7458780'),(45462542,'Калинин Александр Андреевич','07.01.1999','410661, г. Екатеринбург, ул. Школьная, 50, кв. 53','vhopkins@lewis-mullen.com','8 902 7458781'),(45462543,'Кузнецова Милана Владиславовна','24.01.1999','625590, г. Екатеринбург, ул. Коммунистическая, 20, кв. 34','nlewis@yahoo.com','8 902 7458782'),(45462544,'Фирсов Егор Романович','02.09.1993','625683, г. Екатеринбург, ул. 8 Марта, 20, кв. 21','garciadavid@mckinney-mcbride.com','8 902 7458783'),(45462545,'Зимина Агния Александровна','03.09.1998','400562, г. Екатеринбург, ул. Зеленая, 32, кв. 67','cbradley@castro.com','8 902 7458784'),(45462546,'Титов Андрей Глебович','23.10.1985','614510, г. Екатеринбург, ул. Маяковского, 47, кв. 72','cuevascatherine@carlson.biz','8 902 7458785'),(45462547,'Орлов Николай Егорович','27.07.1985','410542, г. Екатеринбург, ул. Светлая, 46, кв. 82','thomasmoore@wilson-singh.net','8 902 7458786'),(45462548,'Кузнецова Аиша Михайловна','04.10.1998','620839, г. Екатеринбург, ул. Цветочная, 8, кв. 100','jessica84@hotmail.com','8 902 7458787'),(45462549,'Куликов Никита Георгиевич','23.04.1999','443890, г. Екатеринбург, ул. Коммунистическая, 1, кв. 10','jessicapark@hotmail.com','8 902 7458788'),(45462550,'Карпова София Егоровна','01.10.1993','603379, г. Екатеринбург, ул. Спортивная, 46, кв. 95','ginaritter@schneider-buchanan.com','8 902 7458789'),(45462551,'Смирнова Дарья Макаровна','22.03.1976','603721, г. Екатеринбург, ул. Гоголя, 41, кв. 57','stephen99@yahoo.com','8 902 7458790'),(45462552,'Абрамова Александра Мироновна','26.03.1999','410172, г. Екатеринбург, ул. Северная, 13, кв. 86','lopezlisa@hotmail.com','8 902 7458791'),(45462553,'Наумов Руслан Михайлович','11.10.1999','420151, г. Екатеринбург, ул. Вишневая, 32, кв. 81','lori17@hotmail.com','8 902 7458792'),(45462554,'Бочаров Никита Матвеевич','29.06.1997','125061, г. Екатеринбург, ул. Подгорная, 8, кв. 74','campbellkevin@gardner.com','8 902 7458793'),(45462555,'Соловьев Давид Ильич','06.03.1984','630370, г. Екатеринбург, ул. Шоссейная, 24, кв. 81','morganhoward@clark.com','8 902 7458794'),(45462556,'Васильева Валерия Дмитриевна','30.09.1999','614753, г. Екатеринбург, ул. Полевая, 35, кв. 39','carsontamara@gmail.com','8 902 7458795'),(45462557,'Макарова Василиса Андреевна','08.04.1999','426030, г. Екатеринбург, ул. Маяковского, 44, кв. 93','kevinpatel@gmail.com','8 902 7458796'),(45462558,'Алексеев Матвей Викторович','02.08.1998','450375, г. Екатеринбург, ул. Клубная, 44, кв. 80','sethbishop@yahoo.com','8 902 7458797'),(45462559,'Никитина Полина Александровна','19.09.1976','625560, г. Екатеринбург, ул. Некрасова, 12, кв. 66','drollins@schultz-soto.net','8 902 7458798'),(45462560,'Окулова Олеся Алексеевна','03.04.1999','630201, г. Екатеринбург, ул. Комсомольская, 17, кв. 25','pblack@copeland-winters.org','8 902 7458799'),(45462561,'Захарова Полина Яновна','21.04.1976','190949, г. Екатеринбург, ул. Мичурина, 26, кв. 93','johnathon.oberbrunner@yahoo.com','8 902 7458800'),(45462562,'Зайцев Владимир Давидович','26.01.1998','350501, г. Екатеринбург, ул. Парковая, 2, кв. 7','bradly29@gmail.com','8 902 7458801'),(45462563,'Иванов Виталий Даниилович','11.08.1976','450048, г. Екатеринбург, ул. Коммунистическая, 21, кв. 3','stark.cristina@hilpert.biz','8 902 7458802'),(45462564,'Захаров Матвей Романович','12.07.1993','644921, г. Екатеринбург, ул. Школьная, 46, кв. 37','bruen.eleanore@yahoo.com','8 902 7458803'),(45462565,'Иванов Степан Степанович','19.09.1998','614228, г. Екатеринбург, ул. Дорожная, 36, кв. 54','percival.halvorson@yahoo.com','8 902 7458804'),(45462566,'Ткачева Милана Тимуровна','24.05.1998','350940, г. Екатеринбург, ул. Первомайская, 23, кв. 2','javonte71@kuhlman.biz','8 902 7458805'),(45462567,'Семенов Даниил Иванович','04.01.1976','344990, г. Екатеринбург, ул. Красноармейская, 19, кв. 92','vconnelly@kautzer.com','8 902 7458806'),(45462568,'Виноградов Вячеслав Дмитриевич','12.07.1976','410248, г. Екатеринбург, ул. Чкалова, 11, кв. 75','anabelle07@schultz.info','8 902 7458807'),(45462569,'Соболева Николь Фёдоровна','02.05.1976','400839, г. Екатеринбург, ул. 8 Марта, 46, кв. 44','nitzsche.katlynn@yahoo.com','8 902 7458808'),(45462570,'Тихонова Анна Львовна','23.03.1985','450539, г. Екатеринбург, ул. Заводская, 3, кв. 81','corine16@von.com','8 902 7458809'),(45462571,'Кузнецова Ульяна Савельевна','03.06.1999','614591, г. Екатеринбург, ул. Цветочная, 20, кв. 40','otha.wisozk@lubowitz.org','8 902 7458810'),(45462572,'Смирнова Анна Германовна','18.07.1997','400260, г. Екатеринбург, ул. Больничная, 30, кв. 53','may.kirlin@hotmail.com','8 902 7458811'),(45462573,'Черепанова Анна Давидовна','06.11.1985','660924, г. Екатеринбург, ул. Молодежная, 32, кв. 59','bryana.kautzer@yahoo.com','8 902 7458812'),(45462574,'Григорьев Максим Кириллович','26.05.1999','644133, г. Екатеринбург, ул. Гагарина, 28, кв. 69','deborah.christiansen@quigley.biz','8 902 7458813'),(45462575,'Голубев Даниэль Александрович','14.06.1999','450698, г. Екатеринбург, ул. Вокзальная, 14, кв. 37','connelly.makayla@yahoo.com','8 902 7458814'),(45462576,'Миронов Юрий Денисович','26.01.1985','620653, г. Екатеринбург, ул. Западная, 15, кв. 25','tatum.collins@fay.org','8 902 7458815'),(45462577,'Терехов Михаил Андреевич','06.07.1976','644321, г. Екатеринбург, ул. Клубная, 32, кв. 10','itzel73@anderson.com','8 902 7458816'),(45462578,'Орлова Алиса Михайловна','24.02.1997','603653, г. Екатеринбург, ул. Молодежная, 2, кв. 45','arjun39@hotmail.com','8 902 7458817'),(45462579,'Кулаков Константин Даниилович','20.06.1993','410181, г. Екатеринбург, ул. Механизаторов, 16, кв. 74','ohara.rebeka@yahoo.com','8 902 7458818'),(45462580,'Кудрявцев Максим Романович','10.05.1998','394207, г. Екатеринбург, ул. Свердлова, 31, кв. 28','danika58@rath.com','8 902 7458819'),(45462581,'Соболева Кира Фёдоровна','14.03.1998','420633, г. Екатеринбург, ул. Матросова, 18, кв. 41','janae.bogan@gmail.com','8 902 7458820'),(45462582,'Коновалов Арсений Максимович','18.02.1985','445720, г. Екатеринбург, ул. Матросова, 50, кв. 67','vern91@yahoo.com','8 902 7458821'),(45462583,'Гусев Михаил Дмитриевич','23.11.1999','400646, г. Екатеринбург, ул. Октябрьская, 47, кв. 65','mariana.leannon@larkin.net','8 902 7458822'),(45462584,'Суханова Варвара Матвеевна','13.09.1993','644410, г. Екатеринбург, ул. Красная, 17, кв. 69','vmoore@gmail.com','8 902 7458823'),(45462585,'Орлова Ясмина Васильевна','24.06.1984','400750, г. Екатеринбург, ул. Школьная, 36, кв. 71','damon.mcclure@mills.com','8 902 7458824'),(45462586,'Васильева Ксения Константиновна','01.08.1999','660590, г. Екатеринбург, ул. Дачная, 37, кв. 70','grady.reilly@block.com','8 902 7458825'),(45462587,'Борисова Тамара Данииловна','29.05.1993','426083, г. Екатеринбург, ул. Механизаторов, 41, кв. 26','boyd.koss@yahoo.com','8 902 7458826'),(45462588,'Дмитриев Мирон Ильич','13.04.1985','410569, г. Екатеринбург, ул. Парковая, 36, кв. 17','obartell@franecki.info','8 902 7458827'),(45462589,'Лебедева Анна Александровна','30.03.1985','443375, г. Екатеринбург, ул. Дзержинского, 50, кв. 95','reina75@ferry.net','8 902 7458828'),(45462590,'Пономарев Артём Маркович','02.06.1984','614316, г. Екатеринбург, ул. Первомайская, 48, кв. 31','karson28@hotmail.com','8 902 7458829'),(45462591,'Борисова Елена Михайловна','23.05.1976','445685, г. Екатеринбург, ул. Зеленая, 7, кв. 47','damaris61@okon.com','8 902 7458830'),(45462592,'Моисеев Камиль Максимович','17.06.1999','614505, г. Екатеринбург, ул. Нагорная, 37, кв. 31','carroll.jerod@hotmail.com','8 902 7458831'),(45462593,'Герасимова Дарья Константиновна','13.10.1984','426629, г. Екатеринбург, ул. Весенняя, 32, кв. 46','ron.treutel@quitzon.com','8 902 7458832'),(45462594,'Михайлова Мария Марковна','02.12.1976','603743, г. Екатеринбург, ул. Матросова, 19, кв. 20','olen79@yahoo.com','8 902 7458833'),(45462595,'Коршунов Кирилл Максимович','22.05.1985','450750, г. Екатеринбург, ул. Клубная, 23, кв. 90','pacocha.robbie@yahoo.com','8 902 7458834'),(45462596,'Иванов Иван Иванович','11.11.2002','Н.Новгород Родионова д.193 кв.113','Dghjkl.mail.ru','8 902 4569876'),(45462597,'Иванов Петр Сергеевич','21.12.1986','Москва ул.Горького д.3 кв.112','dfghjk.mail.ru','8 903 5674345'),(45462625,'Сидоров Евгений Александрович','09.11.2000','г.Москва ул.Грибоедова д.64 кв.42 ','rifg.yandex.ru','8 903 567 54 43'),(45462626,'dfghjkl','12.11.1998','fghjkl.','ghjkl.','vbnm,.'),(45462627,'dfvbnm,.','19.11.1991','vbnm,./rtyui','rtyukl;','fghjkl'),(45462628,'jkl;','14.12.2001','nm,','nm,l.','nmk,l.'),(45462629,'фывапро','19.12.1997','фывапро','фывапр','ФЫВАПР'),(45462630,'крылова','10.12.1998','чсмит','яывсми','ываит'),(45462631,'метелева','17.12.2004','смитьб','митьб','митьбю'),(45462632,'здоров','11.12.1997','митьбю.','пролд','апролдж'),(45462633,'укенгшщ','08.12.2006','апролд','митьбю','пртоьбю.'),(45462634,'sdfghj','08.12.1995','dfghjkl','xcvbnm','cvbnm,.'),(45462635,'sdcvbnm,','08.12.1995','xcvbnm,./','xcvbnm,','sdfghjkl'),(45462636,'qwertyhjk','16.12.1999','dfghjm,./','cfbnm,.','cvbnm,.');
/*!40000 ALTER TABLE `clients` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `employee`
--

DROP TABLE IF EXISTS `employee`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `employee` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `login` varchar(45) NOT NULL,
  `password` varchar(45) NOT NULL,
  `last_entry` datetime DEFAULT NULL,
  `role_id` int NOT NULL,
  `images` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `role_id_idx` (`role_id`),
  CONSTRAINT `role_id` FOREIGN KEY (`role_id`) REFERENCES `role` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=112 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `employee`
--

LOCK TABLES `employee` WRITE;
/*!40000 ALTER TABLE `employee` DISABLE KEYS */;
INSERT INTO `employee` VALUES (101,'Иванов Иван Иванович','Ivanov@namecomp.ru','2L6KZG','2022-05-15 13:13:00',1,'/images/ivanov.jpeg'),(102,'Петров Петр Петрович','petrov@namecomp.ru','uzWC67','2022-05-15 13:13:01',1,'/images/petrov.jpeg'),(103,'Федоров Федор Федорович','fedorov@namecomp.ru','8ntwUp','2022-05-15 13:13:02',2,'/images/fedorov.jpeg'),(104,'Миронов Вениамин Куприянович','mironov@namecomp.ru','YOyhfR','2022-05-15 13:13:03',3,'/images/mironov.jpeg'),(105,'Ширяев Ермолай Вениаминович','shiryev@namecomp.ru','RSbvHv','2022-05-15 13:13:04',3,NULL),(106,'Игнатов Кассиан Васильевич','ignatov@namecomp.ru','rwVDh9','2022-05-15 13:13:05',3,NULL),(107,'Хохлов Владимир Мэлсович','hohlov@namecomp.ru','LdNyos','2022-05-15 13:13:06',1,NULL),(108,'Стрелков Мстислав Георгьевич','strelkov@namecomp.ru','gynQMT','2022-05-15 13:13:07',1,NULL),(109,'Беляева Лилия Наумовна','belyeva@@namecomp.ru','AtnDjr','2022-05-15 13:13:08',1,NULL),(110,'Смирнова Ульяна Гордеевна','smirnova@@namecomp.ru','JlFRCZ','2022-05-15 13:13:09',1,NULL),(111,'тест','test','test','2022-05-15 13:13:00',2,'/images/ivanov.jpeg');
/*!40000 ALTER TABLE `employee` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `orders`
--

DROP TABLE IF EXISTS `orders`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `orders` (
  `id` int NOT NULL AUTO_INCREMENT,
  `code` varchar(45) NOT NULL,
  `time` datetime NOT NULL,
  `clients_id` int NOT NULL,
  `status_id` int NOT NULL,
  `closing_date` varchar(45) DEFAULT NULL,
  `rental_time` int NOT NULL,
  PRIMARY KEY (`id`),
  KEY `clients_id_idx` (`clients_id`),
  KEY `status_id_idx` (`status_id`),
  CONSTRAINT `clients_id` FOREIGN KEY (`clients_id`) REFERENCES `clients` (`id`),
  CONSTRAINT `status_id` FOREIGN KEY (`status_id`) REFERENCES `status` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=123 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `orders`
--

LOCK TABLES `orders` WRITE;
/*!40000 ALTER TABLE `orders` DISABLE KEYS */;
INSERT INTO `orders` VALUES (1,'45462526','2025-10-01 13:00:00',45462526,1,'',120),(2,'45462527','2025-10-01 13:00:01',45462527,2,'',600),(3,'45462528','2025-10-01 13:00:02',45462528,2,'',120),(4,'45462529','2025-10-01 13:00:03',45462529,1,'',600),(5,'45462530','2025-10-01 13:00:04',45462530,3,'16.04.2022',320),(6,'45462531','2025-10-01 13:00:05',45462531,1,'',480),(7,'45462532','2025-10-01 13:00:06',45462532,1,'',240),(8,'45462533','2025-10-01 13:00:07',45462533,2,'',360),(9,'45462534','2025-10-01 13:00:08',45462534,2,'',720),(10,'45462535','2025-10-01 13:00:09',45462535,1,'',120),(11,'45462536','2025-10-01 13:00:10',45462536,3,'22.03.2022',600),(12,'45462537','2025-10-01 13:00:11',45462537,2,'',120),(13,'45462538','2025-10-01 13:00:12',45462538,2,'',600),(14,'45462539','2025-10-01 13:00:13',45462539,2,'',320),(15,'45462540','2025-10-01 13:00:14',45462540,3,'26.04.2022',480),(16,'45462541','2025-10-01 13:00:15',45462541,1,'',240),(17,'45462542','2025-10-01 13:00:16',45462542,2,'',360),(18,'45462543','2025-10-01 13:00:17',45462543,2,'',720),(19,'45462544','2025-10-01 13:00:18',45462544,1,'',120),(20,'45462545','2025-10-01 13:00:19',45462545,1,'',600),(21,'45462546','2025-10-01 13:00:20',45462546,3,'01.04.2022',345),(22,'45462547','2025-10-01 13:00:21',45462547,1,'',120),(23,'45462548','2025-10-01 13:00:22',45462548,1,'',600),(24,'45462549','2025-10-01 13:00:23',45462549,2,'',320),(25,'45462550','2025-10-01 13:00:24',45462550,2,'',480),(26,'45462551','2025-10-01 13:00:25',45462551,2,'',240),(27,'45462552','2025-10-01 13:00:26',45462552,2,'',360),(28,'45462553','2025-10-01 13:00:27',45462553,3,'08.04.2022',720),(29,'45462554','2025-10-01 13:00:28',45462554,1,'',120),(30,'45462555','2025-10-01 13:00:29',45462555,2,'',600),(31,'45462556','2025-10-01 13:00:30',45462556,2,'',120),(32,'45462557','2025-10-01 13:00:31',45462557,1,'',600),(33,'45462558','2025-10-01 13:00:32',45462558,1,'',120),(34,'45462559','2025-10-01 13:00:33',45462559,1,'',600),(35,'45462560','2025-10-01 13:00:34',45462560,2,'',320),(36,'45462561','2025-10-01 13:00:35',45462561,2,'',480),(37,'45462562','2025-10-01 13:00:36',45462562,2,'',240),(38,'45462563','2025-10-01 13:00:37',45462563,3,'04.04.2022',360),(39,'45462564','2025-10-01 13:00:38',45462564,2,'',720),(40,'45462565','2025-10-01 13:00:39',45462565,1,'',480),(41,'45462566','2025-10-01 13:00:40',45462566,3,'07.04.2022',320),(42,'45462567','2025-10-01 13:00:41',45462567,2,'',480),(43,'45462568','2025-10-01 13:00:42',45462568,2,'',240),(44,'45462569','2025-10-01 13:00:43',45462569,2,'',360),(45,'45462570','2025-10-01 13:00:44',45462570,2,'',120),(46,'45462571','2025-10-01 13:00:45',45462571,2,'',720),(47,'45462572','2025-10-01 13:00:46',45462572,3,'04.04.2022',320),(48,'45462573','2025-10-01 13:00:47',45462573,1,'',240),(49,'45462574','2025-10-01 13:00:48',45462574,1,'',240),(50,'45462575','2025-10-01 13:00:49',45462575,3,'27.02.2026',360),(51,'45462576','2025-10-01 21:04:43',45462562,2,'04.04.2022',600),(52,'45462577','2025-10-01 21:17:23',45462562,2,'04.04.2022',600),(53,'45462578','2025-10-01 21:19:44',45462562,2,'04.04.2022',600),(54,'45462579','2025-10-01 21:22:25',45462562,2,'04.04.2022',600),(55,'45462580','2025-10-01 21:33:04',45462562,2,'04.04.2022',600),(56,'45462581','2025-10-01 21:35:37',45462562,2,'04.04.2022',600),(57,'45462582','2025-10-02 17:16:41',45462562,2,'04.04.2022',600),(58,'45462583','2025-12-05 10:36:42',45462529,2,NULL,30),(59,'45462584','2025-12-05 10:52:34',45462533,2,NULL,225),(60,'45462585','2025-12-05 13:12:40',45462539,2,NULL,155),(61,'45462586','2025-12-05 13:34:39',45462526,2,NULL,30),(62,'45462587','2025-12-05 13:43:33',45462538,2,NULL,30),(63,'45462588','2025-12-05 14:05:25',45462541,2,NULL,30),(64,'45462589','2025-12-05 14:09:09',45462533,2,NULL,30),(66,'45462590','2025-12-05 14:22:19',45462531,2,NULL,30),(67,'45462590','2025-12-05 14:24:03',45462536,2,NULL,30),(68,'45462591','2025-12-10 20:02:18',45462531,2,NULL,30),(69,'45462592','2025-12-25 19:47:46',45462529,2,NULL,180),(70,'45462592','2025-12-25 19:47:51',45462529,2,NULL,180),(71,'45462593','2025-12-25 19:53:45',45462533,2,NULL,30),(72,'45462594','2025-12-25 20:36:54',45462538,2,NULL,30),(73,'45462595','2025-12-26 16:34:48',45462532,2,NULL,30),(74,'45462596','2025-12-26 16:40:38',45462533,2,NULL,30),(75,'45462597','2026-01-13 13:37:46',45462529,2,NULL,30),(76,'45462598','2026-01-13 13:41:46',45462534,2,NULL,30),(77,'45462599','2026-01-13 16:11:36',45462535,2,NULL,30),(78,'45462600','2026-01-13 16:23:14',45462537,2,NULL,30),(79,'45462601','2026-01-13 16:32:47',45462537,2,NULL,30),(80,'45462602','2026-01-13 16:34:40',45462539,2,NULL,30),(81,'45462603','2026-01-13 16:37:45',45462538,2,NULL,30),(82,'45462604','2026-01-13 16:39:02',45462539,2,NULL,30),(83,'45462605','2026-01-13 16:40:45',45462539,2,NULL,30),(84,'45462606','2026-01-13 17:01:26',45462536,2,NULL,30),(85,'45462607','2026-01-13 17:07:20',45462538,2,NULL,30),(86,'45462608','2026-01-13 17:18:30',45462538,2,NULL,30),(87,'45462609','2026-01-13 17:25:54',45462533,2,NULL,30),(88,'45462610','2026-01-16 19:15:16',45462536,2,NULL,30),(89,'45462611','2026-01-16 19:45:46',45462537,2,NULL,30),(90,'45462612','2026-01-16 20:01:33',45462534,2,NULL,30),(91,'45462613','2026-01-20 17:35:23',45462536,2,NULL,30),(92,'45462614','2026-02-16 17:14:46',45462536,2,NULL,30),(93,'45462615','2026-02-16 18:10:38',45462537,2,NULL,30),(94,'45462616','2026-02-16 18:21:38',45462539,2,NULL,30),(95,'45462617','2026-02-18 16:11:22',45462537,2,NULL,30),(96,'45462618','2026-02-18 18:33:56',45462526,2,NULL,317),(97,'45462619','2026-02-18 18:38:04',45462533,2,NULL,327),(98,'45462620','2026-02-18 21:31:49',45462539,2,NULL,30),(99,'45462621','2026-02-18 21:37:05',45462540,2,NULL,30),(100,'45462622','2026-02-18 21:57:10',45462538,2,NULL,473),(101,'45462623','2026-02-18 22:01:10',45462537,2,NULL,30),(102,'45462624','2026-02-18 22:09:10',45462536,2,NULL,30),(103,'45462625','2026-02-18 22:11:09',45462540,2,NULL,30),(104,'45462626','2026-02-19 18:08:41',45462536,2,NULL,30),(105,'45462627','2026-02-19 18:16:27',45462539,2,NULL,108),(106,'45462628','2026-02-19 19:30:15',45462537,2,NULL,30),(107,'45462629','2026-02-19 19:39:42',45462538,2,NULL,30),(108,'45462630','2026-02-25 18:41:00',45462536,2,NULL,160),(109,'45462631','2026-02-25 18:53:24',45462534,2,NULL,711),(110,'45462632','2026-02-25 19:26:30',45462535,2,NULL,30),(111,'45462633','2026-02-25 19:30:15',45462539,2,NULL,30),(112,'45462634','2026-02-25 19:33:31',45462540,2,NULL,30),(113,'45462635','2026-02-25 19:37:22',45462526,2,NULL,30),(114,'45462636','2026-02-25 19:40:01',45462535,2,NULL,30),(115,'45462637','2026-02-25 19:49:16',45462532,2,NULL,30),(116,'45462638','2026-02-25 19:51:54',45462531,2,NULL,30),(117,'45462639','2026-02-25 19:53:08',45462536,2,NULL,30),(118,'45462640','2026-02-25 19:54:27',45462539,2,NULL,30),(119,'45462641','2026-02-25 19:55:26',45462538,2,NULL,30),(120,'45462642','2026-02-25 19:59:22',45462532,2,NULL,30),(121,'45462643','2026-02-25 20:00:23',45462536,2,NULL,30),(122,'45462644','2026-05-12 20:25:05',45462535,2,NULL,30);
/*!40000 ALTER TABLE `orders` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `orders_services`
--

DROP TABLE IF EXISTS `orders_services`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `orders_services` (
  `id_orders` int NOT NULL,
  `id_services` int NOT NULL,
  PRIMARY KEY (`id_orders`,`id_services`),
  KEY `id_services_idx` (`id_services`),
  CONSTRAINT `id_orders` FOREIGN KEY (`id_orders`) REFERENCES `orders` (`id`),
  CONSTRAINT `id_services` FOREIGN KEY (`id_services`) REFERENCES `services` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `orders_services`
--

LOCK TABLES `orders_services` WRITE;
/*!40000 ALTER TABLE `orders_services` DISABLE KEYS */;
INSERT INTO `orders_services` VALUES (1,31),(6,31),(69,31),(70,31),(75,31),(81,31),(82,31),(83,31),(85,31),(89,31),(92,31),(95,31),(98,31),(102,31),(112,31),(113,31),(114,31),(115,31),(116,31),(117,31),(118,31),(119,31),(120,31),(121,31),(122,31),(1,34),(6,34),(68,34),(74,34),(77,34),(78,34),(80,34),(84,34),(86,34),(88,34),(90,34),(91,34),(93,34),(98,34),(104,34),(109,34),(111,34),(112,34),(113,34),(114,34),(115,34),(116,34),(117,34),(118,34),(119,34),(120,34),(121,34),(62,44),(67,44),(69,44),(70,44),(76,44),(122,44),(2,45),(3,45),(4,45),(109,45),(3,57),(4,57),(62,57),(63,57),(68,57),(72,57),(73,57),(106,57),(3,88),(100,88),(107,88),(110,88),(2,89),(68,89),(73,89),(94,89),(100,89),(105,89),(3,92),(4,92),(63,92),(67,92),(72,92),(97,92),(101,92),(104,92),(108,92),(2,98),(5,98),(94,98),(99,98),(105,98),(106,98),(110,98),(2,99),(87,99),(96,99),(97,99),(100,99),(2,123),(93,123),(94,123),(95,123),(99,123),(103,123),(105,123),(106,123),(108,123),(109,123),(110,123),(1,336),(5,336),(62,336),(96,336),(1,353),(5,353),(6,353),(79,353),(86,353),(110,353);
/*!40000 ALTER TABLE `orders_services` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `role`
--

DROP TABLE IF EXISTS `role`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `role` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(45) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `role`
--

LOCK TABLES `role` WRITE;
/*!40000 ALTER TABLE `role` DISABLE KEYS */;
INSERT INTO `role` VALUES (1,'Продавец'),(2,'Администратор'),(3,'Старший смены');
/*!40000 ALTER TABLE `role` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `services`
--

DROP TABLE IF EXISTS `services`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `services` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `code` varchar(45) NOT NULL,
  `price` int NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=354 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `services`
--

LOCK TABLES `services` WRITE;
/*!40000 ALTER TABLE `services` DISABLE KEYS */;
INSERT INTO `services` VALUES (31,'Прокат опорного оборудования для катка','JUR8R',500),(34,'Обучение катанию на коньках','JKFBJ09',1000),(44,'Прокат салазок','DHBGFY563',450),(45,'Прокат набора защитного оборудования','JFH7382',800),(57,'Прокат ледянки','JHVSJF6',300),(88,'Катание на  катке','DJHGBS982',400),(89,'Прокат детских коньков','OIJNB12',800),(92,'Прокат санок','HJBUJE21J',300),(98,'Прокат шлема','63748HF',300),(99,'Прокат вартушки','BSFBHV63',100),(123,'Катание на горках','638VVNQ3',500),(336,'Прокат коньков','8HFJHG443',1200),(353,'Заточка коньков','87FDJKHJ',500);
/*!40000 ALTER TABLE `services` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `status`
--

DROP TABLE IF EXISTS `status`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `status` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(45) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `status`
--

LOCK TABLES `status` WRITE;
/*!40000 ALTER TABLE `status` DISABLE KEYS */;
INSERT INTO `status` VALUES (1,'Новая'),(2,'В прокате'),(3,'Закрыта');
/*!40000 ALTER TABLE `status` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-06-12 14:37:43
